import React, { useState, useEffect } from "react";
import HeaderStrip from "./Components/Header/HeaderStrip";
import HeaderLogo from "./Components/Header/HeaderLogo";
import HeaderNavigation from "./Components/Header/HeaderNavigation";
import Footer from "./Components/Body/Footer";
import "./App.css";
import { styled } from "styled-components";
function App() {
  const getLang = localStorage.getItem("language");
  const [language, setLanguage] = useState(
    getLang ? JSON.parse(getLang) : "ka"
  );
  const changeLanguage = (e) => {
    setLanguage(e);
    localStorage.setItem("language", JSON.stringify(e));
  };
  const getCurr = localStorage.getItem("currency");
  const [currency, setCurrency] = useState(getCurr ? JSON.parse(getCurr) : 1);
  const changeCurrency = (e) => {
    setCurrency(e);
    localStorage.setItem("currency", JSON.stringify(e));
  };
  const getCurrSign = localStorage.getItem("currencySign");
  const [currencySign, setCurrencySign] = useState(
    getCurrSign ? JSON.parse(getCurrSign) : "₾"
  );
  const changeCurrencySign = (e) => {
    setCurrencySign(e);
    localStorage.setItem("currencySign", JSON.stringify(e));
  };
  const existingBasket = localStorage.getItem("basket");
  const [basketQuantity, setBasketQuantity] = useState(
    existingBasket ? JSON.parse(existingBasket).length : 0
  );
  const [basketQuantity2, setBasketQuantity2] = useState(
    existingBasket ? JSON.parse(existingBasket).length : 0
  );
  const handleBasketQuantityChange2 = (quantity) => {
    setBasketQuantity2(quantity);
  };
  useEffect(() => {
    setBasketQuantity(basketQuantity2);
  }, [basketQuantity2]);
  return (
    <>
      <HeaderStrip
        currencySet={changeCurrency}
        currencySignSet={changeCurrencySign}
        languageSet={changeLanguage}
        lang={language}
      />
      <HeaderLogo
        badge={basketQuantity}
        onBasketQuantityChange2={handleBasketQuantityChange2}
      />
      <HeaderNavigation lang={language} />
      <Terms>
        <p className="sectionName">1. ტერმინთა განმარტებანი</p>
        <br />
        <p className="sectionNum">1.1</p> “მეიჯარე”- იჯარის საგნის გამქირავებელი{" "}
        <br />
        <p className="sectionNum">1.2</p> “მოიჯარე” - იჯარის საგნის
        დამქირავებელი <br />
        <p className="sectionNum"> 1.3</p> მხარეები - “მეიჯარე” და “მოიჯარე”;{" "}
        <br />
        <p className="sectionNum"> 1.4</p> ხელშეკრულება - მხარეთა შორის
        წერილობითი შეთანხმება იჯარის საგნის ქირავნობაზე, ხელშეკრულებით
        გათვალისწინებულ სხვა ქმედებებზე. <br />
        <p className="sectionNum"> 1.5</p> იჯარის საგანი –მოწყობილობები,
        აღჭურვილობები და სხვა ინვენტარი, რომელთა ჩამონათვალი განსაზღვრულია
        ხელშეკრულებაში; <br />
        <br />
        <p className="sectionName">2. ხელშეკრულების საგანი</p> <br />
        <p className="sectionNum"> 2.1</p> მეიჯარეს და მოიჯარეს შორის
        ურთიერთობის დაწყების საფუძველია, მხარეთა შორის წერილობით გაფორმებული
        ხელშეკრულება ან შეთანხმება, იჯარის საგნის ქირავნობის შესახებ, რაც უნდა
        იყოს დადასტურებული მხარეთა ხელმოწერებით (იუირიდიული პირებს შორის
        გაფორმებული ხელშეკრლების შემთხევაში, იურიდიული პირების ხელმძღვანელი
        პირების ხელმოწერებით). <br />
        <p className="sectionNum"> 2.2</p> ხელშეკრულების საგანს წარმოადგენს
        –მოწყობილობები, აღჭურვილობები და სხვა ინვენტარი. <br />
        <br />
        <p className="sectionName">
          3. ხელშეკრულების შესრულების ვადა და პირობები
        </p>{" "}
        <br />
        <p className="sectionNum">3.1</p> ხელშეკრულებით გათვალისწინებული იჯარის
        საგნის ქირავნობის ვადა აითვლება, მოიჯარის მიერ მოწყობილობის გამოტანით
        “მეიჯარის” ბაზიდან და მთავრდება ”მოიჯარის” მიერ მისი დაბრუნებით
        ”მეიჯარის” ბაზაზე. (ან „მეიჯარის“ მიერ „მოიჯარესათვის“ ბაზის გარეთ
        გადაცემის შემთხვევაში თანდართული დოკუმეტნაციის შევსების შედეგად) <br />
        <p className="sectionNum">3.2</p> იჯარის ხანგრძლივობის ასათვლელად
        „იჯარის დღე“, პირველ დღედ ითვლება მოწყობილობების გადაცემის დღე, ხოლო
        ბოლო დღედ, მოწყობილობების ბაზაზე დაბრუნების დღე. თუ იჯარის საგანი
        დაბრუნდა 10.00 საათამდე, მაშინ დაბრუნების დღედ ჩაითვლება წინა დღე.{" "}
        <br />
        <p className="sectionNum"> 3.3</p> ხელშეკრულების მაქსიმალური ვადა არის
        60 დღე, თუ ხელშეკრულებით სხვა რამ არ არის გათვალისწინებული. <br />
        <p className="sectionNum"> 3.4</p> ხელშეკრულებაში მითითებული ვადის
        გადაცილების შემთხვევაში, „მოიჯარე” ვალდებულია გადაუხადოს „მეიჯარეს”
        გადაცილებული ვადის საფასურის სამმაგი ოდენობა. <br />
        <br />
        <p className="sectionName">4. იჯარის საგნის გადაცემა და დაბრუნება</p>
        <br />
        <p className="sectionNum"> 4.1</p> იჯარის საგნის მიღებისას „მოიჯარე”
        ვალდებულია დაუყოვნებლივ შეამოწმოს მოწყობილობების რაოდენობა და მათი
        ტექნიკური მდგომარეობა. ნაკლის აღმოჩენის ან მოწყობილობის მიმართ რაიმე
        პრეტენზიის არსებობის შემთხვევაში შეატყობინოს „მეიჯარეს”, არა უგვიანეს 2
        (ორი) დღისა. <br />
        <p className="sectionNum"> 4.2</p> „მოიჯარემ” იჯარის საგანი უნდა
        დაუბრუნოს „მეიჯარეს” ისეთივე მდგომარეობაში, როგორშიც ჩაიბარა, ბუნებრივი
        ცვეთის გათვალისწინებით. <br />
        <p className="sectionNum"> 4.3</p> იჯარის საგნის დაბრუნებისას საგნის
        დაბრუნება უნდა დადასტურდეს მხარეთა ხელმოწერებით. <br />
        <p className="sectionNum"> 4.4</p> იჯარის საგანი (ხარაჩოები, ყალიბები და
        ა.შ.) დაბრუნებისას შეფუთული უნდა იყოს შეფუთვის ინსტრუქციის მიხედვით.
        წინააღმდეგ შემთხვევაში ”მეიჯარეს” უფლება აქვს ”მოიჯარისგან” მოითხოვოს
        კომპენსაციის გადახდა მოქმედი პრეისკურანტის მიხედვით. <br />
        <p className="sectionNum"> 4.5</p> თუ ”მეიჯარეს”, იჯარის ვადის გასვლიდან
        10 (ათი) კალენდარული დღის განმავლობაში არ დაუბრუნდა იჯარის საგანი, იგი
        ითვლება დაკარგულად. <br />
        <p className="sectionNum"> 4.6</p> იჯარის საგნის დაუბრუნებლობის
        შემთხევვაში, „მეიჯარე” უფლებამოსილია მიიღოს ზომები, მათ შორის მიმართოს
        სასამართლოს. <br />
        <p className="sectionNum">4.7</p> „მეიჯარეს” უფლება აქვს უარი თქვას
        მოწყობილობის უკან მიღებაზე და მოითხოვოს ”მოიჯარისაგან” კომპენსაციის
        გადახდა მოწყობილობის შესაკეთებლად ან ახლის შესაძენად, თუ დაბრუნებულ
        მოწყობილობას ჩათვლის შემდგომში გამოყენებისათვის უვარგისად, ან
        მნიშვნელოვნად დაზიანებულად. <br />
        <br />
        <p className="sectionName">
          5. იჯარის საფასური და საგარანტიო თანხა
        </p>{" "}
        <br />
        <p className="sectionNum"> 5.1</p> “მეიჯარე” იჯარის საფასურს
        განსაღზვრავს, მოწყობილობის გაცემის მომენტისათვის მოქმედი პრეისკურანტის
        მიხედვით, დ.ღ.გ.-ს ჩათვლით. <br />
        <p className="sectionNum"> 5.2</p> იჯარის საფასური შეიცავს მხოლოდ იჯარის
        საგნით დროებით სარგებლობისათვის დაწესებულ საფასურს <br />
        <p className="sectionNum"> 5.3</p> იჯარის საფასური არ შეიცავს
        პროექტირების, მონტაჟის, დემონტაჟის, დაყენების, დაკვირვების, გამართვის,
        ტრანსპორტირების და დატვირთვა-გადმოტვირთვის ფასს. <br />
        <p className="sectionNum"> 5.4</p> იჯარის საფასური ან ხელშეკრულებით
        გათვალისწინებული სხვა გადასახადი გადახდილად ითვლება ნაღდი ან უნაღდო
        ანგარიშსწორებისას „მეიჯარის” საბანკო ანგარიშზე.
        <br />
        <br />
        <p className="sectionName">6. მხარეთა უფლება-მოვალეობები</p> <br />
        <p className="sectionNum">6.1</p> „მოიჯარე” ვალდებულია: <br />
        <p className="sectionNum"> 6.1.1</p> იჯარის საგანი გამოიყენოს, მათი
        გამოყენების წესის შესაბამისად; <br />
        <p className="sectionNum"> 6.1.2</p> გამოიყენოს იჯარის საგანი,
        “მეიჯარესაგან” მიღებული წესებისა და ინსტრუქციების დაცვით, უსაფრთხოების
        ზომების გათვალისწინებით (მუშაკებისათვის სპეცტანსაცმლის მოთხოვნა,
        უსაფრთხოების მოთხოვნების დაცვა სამუშაო ადგილზე). <br />
        <p className="sectionNum"> 6.1.3</p> იჯარის საგნის გამოყენებასთან
        დაკავშირებით არსებული საკითხების წარმოჭრისას „მოიჯარე” ვალდებულია
        დაუკავშირდეს “მეიჯარეს” ; <br />
        <p className="sectionNum"> 6.1.4</p> “მეიჯარის” წერილობითი ნებართვის
        გარეშე არ მოახდინოს მოწყობილობების სახეცვლილება, მოდიფიცირება და
        შეკეთება საკუთარი ინიციატივით; <br />
        <p className="sectionNum"> 6.1.5</p> შეატყობინოს იჯარით გამცემს
        მოწყობილობის ნებისმიერი დაზიანების ან ნაწილობრივი განადგურების შესახებ
        და მიიღოს ზომები ზარალის გაზრდის თავიდან ასაცილებლად; <br />
        <p className="sectionNum"> 6.1.6</p> “მეიჯარის” წერილობითი ნებართვის
        გარეშე მოწყობილობის გამოყენების უფლება არ მისცეს მესამე პირს. მესამე
        პირად არ შეიძლება ჩაითვალონ პირები, რომლებიც მუშაობენ „მოიჯარის”
        დაქვემდებარებულ საწარმოში, ასევე ის პირები, რომელთაც „მეიჯარე” მუდმივად
        იყენებს თავის საწარმოო და პროფესიულ საქმიანობაში; <br />
        <p className="sectionNum"> 6.1.7</p> საკუთარი სახსრებით უზრუნველყოს
        მოწყობილობების ტექნიკური მომსახურება, კერძოდ იმ ნაკლოვანებების
        აღმოსაფხვრელად, რომლებმაც შეიძლება ხელი შეუშალონ მოწყობილობის
        ექსპლუატაციას, აგრეთვე უზრუნველყოს შენახვის, შეკეთების და გასუფთავების
        წესები; <br />
        <p className="sectionNum"> 6.1.8</p> მოწყობილობის ადგილმდებარეობის
        შეცვლის შემთხვევაში „მოიჯარემ” დაუყოვნებლივ უნდა შეატყობინოს „მეიჯარეს”.
        არ დაუშვას მოწყობილობის საქართველოს ფარგლებს გარეთ გატანა “მეიჯარის”
        წერილობითი თანხმობის გარეშე; <br />
        <p className="sectionNum"> 6.1.9</p> იჯარის ვადის გასვლის შემდეგ
        დაუბრუნოს “მეიჯარეს” ყველა მოწყობილობა ხელშეკრულებაში გათვალისწინებული
        პირობების და დადგენილი წესის თანახმად. <br />
        <p className="sectionNum"> 6.1.10</p> „მოიჯარე” თანახმაა ხელშეკრულების
        დადებისას „მეიჯარესათვის” ცნობილი გახდეს მისი პირადი მონაცემები (სახელი
        და გვარი, პირადობის მოწმობის ნომერი, მისამართი, პირადი ფოტო, პასპორტის
        ასლი, სახელშეკრულებო ვალდებულებების შეუსრულებლობის მონაცემები, მათ შორის
        დავალიანების ზომების შესახებ) და გადაეცეს მესამე პირებს (დავალიანების
        მზღვეველ სააგენტოს, იურიდიულ კონსულტატებს, იურიდიულ ფირმებს), იჯარით
        გაცემული მოწყობილობების აღდგენის და დაბრუნების ან მოიჯარის საკრედიტო
        საშუალებების შეფასების მიზნით. „მოიჯარე”-ს უფლება აქვს მოსთხოვოს
        „მეიჯარეს” ინფორმაცია იმაზე თუ რომელ მესამე პირს და რა მიზნით გადასცა
        მან მოიჯარის პირადი მონაცემები.
        <br />
        <p className="sectionNum">6.2</p> „მეიჯარე” ვალდებულია: <br />
        <p className="sectionNum">6.2.1</p> უზრუნველყოს მოწყობილობების გადაცემა
        ხელშეკრულებაში შეთანხმებულ დროში და ადგილზე; <br />
        <p className="sectionNum"> 6.2.2</p> გადასცეს მოიჯარეს იჯარის საგანი
        გამართულ მდგომარეობაში.
        <br />
        <p className="sectionNum"> 6.2.3</p> თუ 6.1.7.-ით გაუთვალისწინებელი
        შეკეთების სამუშაოებია შესასრულებელი და ეს სამუშაოები „მოიჯარი”-ს
        ვალდებულებების შეუსრულებლობითაა გამოწვეული, „მეიჯარე” უფლება აქვს
        მოითხოვოს კლიენტისაგან ყველა ხარჯის ანაზღაურება. <br />
        <p className="sectionNum"> 6.3</p> “მეიჯარე” განიხილავს “მოიჯარეს” მიერ
        დასმულ ყველა საკითხს, რომელიც ეხება: აღჭურვილობის და მოწყობილობების
        გაქირავებას, იჯარის საფასურს, მის ტექნიკურ მდგომარეობას, გამოყენების
        წესებს, მათ შორის უსაფრთხოების ტექნიკის მოთხოვნილებებს და ამომწურავ
        პასუხს გასცემს მათზე; <br />
        <br />
        <p className="sectionName">7. პასუხისმგებლობა</p> <br />
        <p className="sectionNum"> 7.1</p> თუ ხელშეკრულების დარღვევა გამოწვეულია
        მეორე მხარის მიერ, ზარალი იფარება ან იხდება პირგასამტეხლო, როგორც
        დაზღვევის კომპენსაცია, თუ ხელშეკრულებაში ან მის დანართში სხვა რამე არ
        არის გათვალისწინებული. <br />
        <p className="sectionNum"> 7.2</p> „მოიჯარე” იჯარის მთელი პერიოდის
        განმავლობაში პასუხისმგებელია მოწყობილობის მწყობრიდან გამოსვლაზე, მის
        დაკარგვაზე და ზარალზე გარდა შეფერხებებისა, რომლებიც გამოწვეულია
        ნორმალური ცვეთით ან „მეიჯარის” მიერ შეკეთების ვალდებულებათა
        შეუსრულებლობით. <br />
        <p className="sectionNum"> 7.3</p> მოწყობილობის დაკარგვის ან
        განადგურების შემთხვევაში „მოიჯარე” იხდის მოწყობილობის ღირებულებას
        მთლიანად ან მისი აღდგენის საფასურს, ადგილობრივი საბაზრო ფასებით. <br />
        <p className="sectionNum"> 7.4</p> მოწყობილობების უსაფრთხოდ გამოყენების
        შედეგად ყველა არსებულ რისკზე პასუხს აგებს „მოიჯარე“ <br />
        <p className="sectionNum"> 7.5</p> „მეიჯარე” პასუხს ითხოვს იჯარის მთელ
        პერიოდში, მოიჯარის ან ნებისმიერი მესამე პირის მიერ მოწყობილობის
        გამოყენებაზე და მისთვის ზიანის მიყენებაზე. შესაძლებელ შეცდომებზე და
        ზიანზე პასუხს აგებს „მოიჯარე”. <br />
        <p className="sectionNum"> 7.6</p> „მეიჯარეს” პასუხისმგებლობა იჯარის
        პერიოდში მოწყობილობის დაზიანების შემთხვევაში შემოიფარგლება მოწყობილობის
        შეცვლით ან შეკეთებით, შეტყობინების მიღებიდან გონივრულ ვადებში. Aასევე
        იგი პასუხს არ აგებს დაზიანებით გამოწვეული სამუშაოების ვადების
        გაგრძელებით მიღებულ ზარალზე.
        <br />
        <p className="sectionNum"> 7.7</p> მოწყობილობის შემთხვევით განადგურების
        ან დაზიანების რისკის შემთხვევაში მისი საფასურის კომპენსაციის ვალდებულება
        გადადის „მოიჯარეზე” და თანხის გადახდის შემდეგ გადაეცემა მას. <br />
        <br />
        <p className="sectionName">8. ხელშეკრულების შეწყვეტა</p> <br />
        <p className="sectionNum"> 8.1</p> ხელშეკრულების ვადის გასვლისთანავე,
        მოწყობილობები უბრუნდება „მეიჯარეს” და ხელშეკრულება წყდება მხარეთა შორის
        შეთანხმების საფუძველზე; <br />
        <p className="sectionNum"> 8.2</p> „მეიჯარე” უფლება აქვს ვადაზე ადრე
        გაწყვიტოს ხელშეკრულება, რაც წერილობით უნდა შეატყობინოს „მოიჯარე”-ს არა
        ნაკლები 3 (სამი) კალენდარული დღით ადრე, იმ შემთხვევაში თუ: <br />
        <p className="sectionNum"> 8.2.1</p> „მოიჯარე” საგადასახადო დავალების
        მიღების შემდეგ 10 (ათი) კალენდარული დღის განმავლობაში არ იხდის იჯარის
        გადასახადს;
        <br />
        <p className="sectionNum"> 8.2.2</p> „მოიჯარი”-ს ისეთი ქმედებების
        შემთხვევაში, რომლებმაც შეიძლება გამოიწვიონ მოწყობილობის მდგომარეობის
        გაუარესება, თუ არსებობს მოწყობილობის დაკარგვისა ან ექსპლოატაციის წესების
        დარღვევის გამო მოწყობილობის გამოუსადეგარად ქცევის რისკი; <br />
        <p className="sectionNum"> 8.2.3</p> „მოიჯარე” გადასცემს იჯარით აღებულ
        მოწყობილობას მესამე პირს „მეიჯარეს” წინასწარი წერილობითი შეთანხმების
        გარეშე; <br />
        <p className="sectionNum"> 8.2.4</p> „მოიჯარე” – იურიდიული პირის მიმართ
        აღძრულია ბანკროტობისა და ლიკვიდაციის საქმე; <br />
        <p className="sectionNum"> 8.2.5</p> „მოიჯარე” არღვევს რომელიმე
        სახელშეკრულებო ან იურიდიულ ვალდებულებას და არ აღმოფხვრავს დარღვევას
        დროის გონივრულ პერიოდში, მიუხედავად „მეიჯარეს” წერილობითი გაფრთხილებისა;
        <br />
        <p className="sectionNum"> 8.3</p> „მოიჯარე”-ს უფლება აქვს გაწყვიტოს
        ხელშეკრულება და დააბრუნოს მოწყობილობები იგივე პირობებით. <br />
        <br />
        <p className="sectionName">9. სხვა პირობები</p> <br />
        <p className="sectionNum"> 9.1</p> იმ შემთხვევაში თუ მხარეები საჭიროდ
        ჩათვლიან რაიმე დამატებითი პირობების გამოყენებას, ეს პირობები ცალკე უნდა
        აისახოს წერილობით, ხეშეკრულების დანართში, ეს დანართი კი ხელშეკრულების
        განუყოფელი ნაწილია; <br />
        <p className="sectionNum"> 9.2</p> ორივე მხარეს უფლება აქვს შეცვალოს
        ხელშეკრულების პირობები, რაზეც უნდა შეატყობინოს მეორე მხარეს წერილობით;{" "}
        <br />
        <span className="sectionNum"> 9.3</span> მხარეებს შორის ყველა დავის
        გადაჭრა ხდება მოლაპარაკების გზით. Mმოლაპარაკების გზით დავის გადაჭრის
        შეუძლებლობის შემთხვევაში დავა განიხილება მოსარჩელე მხარის მიერ
        სასამართლოში ან კერძო არბიტრაჟში მოქმედი კანონმდებლობით დადგენილი წესით.
      </Terms>
      <Footer basketQuantity2={basketQuantity2} />
    </>
  );
}

export default App;

const Terms = styled.p`
  padding: 5%;
  color: #000000;
  font-family: "Noto Sans Georgian", sans-serif;
  font-size: 14px;
  font-weight: 300;
  line-height: 20px;
  overflow: hidden;
  letter-spacing: 0.2px;
  max-width: 1200px;
  margin: auto;
  .sectionName {
    font-size: 16px;
    font-weight: 400;
    padding: 0px;
    margin-top: 10px;
  }
  .sectionNum {
    font-size: 16px;
    font-weight: 400;
    padding: 0px;
    display: inline;
  }
`;
